In [1]:
import pandas as pd

In [3]:
df1 = pd.DataFrame([["Shah","Male",114000.00],
                    ["Vats","Male",65000.00],
                    ["Vats","Female",43150.00],
                    ["Kumar","Female",69500],
                    ["Vats","Female",155000.00],
                    ["Kumar","Male",103000.00],
                    ["Shah","Male",55000.00],
                    ["Shah","Female",112400.00],
                    ["Kumar","Female",81030.00],
                    ["Vats","Male",71900.00]], columns = ["Name","Gender","MonthlyIncome"])
df1

    Name  Gender  MonthlyIncome
0   Shah    Male       114000.0
1   Vats    Male        65000.0
2   Vats  Female        43150.0
3  Kumar  Female        69500.0
4   Vats  Female       155000.0
5  Kumar    Male       103000.0
6   Shah    Male        55000.0
7   Shah  Female       112400.0
8  Kumar  Female        81030.0
9   Vats    Male        71900.0

In [4]:
df1.groupby("Name")["MonthlyIncome"].sum()

Name
Kumar    253530.0
Shah     281400.0
Vats     335050.0
Name: MonthlyIncome, dtype: float64

In [5]:
group = df1.groupby("Name")
max_income = group["MonthlyIncome"].max()
pd.merge(df1,max_income)

    Name  Gender  MonthlyIncome
0   Shah    Male       114000.0
1   Vats  Female       155000.0
2  Kumar    Male       103000.0

In [6]:
df1.loc[df1.iloc[:,2]>60000,:]

    Name  Gender  MonthlyIncome
0   Shah    Male       114000.0
1   Vats    Male        65000.0
3  Kumar  Female        69500.0
4   Vats  Female       155000.0
5  Kumar    Male       103000.0
7   Shah  Female       112400.0
8  Kumar  Female        81030.0
9   Vats    Male        71900.0

In [7]:
groups = df1.groupby(["Name","Gender"])
mean_df = groups.mean()

In [8]:
mean_df.loc["Shah"].loc["Female"]

MonthlyIncome    112400.0
Name: Female, dtype: float64